# ### 第34题
# 问题：定义一个函数，它可以生成一个列表，其中的值是1到20之间的数的平方(包括这两个数)，然后函数需要打印列表中的前5个元素。
# 提示：使用**运算符得到一个数字的幂。对循环使用range()，使用list.append()向列表中添加值，使用[n1:n2]对列表进行切片；
#
def funa():
    li = []
    for i in range(1,21):
        li.append(i ** 2)
    print(li[ :5])
funa()

# ### 第35题
# 问题：定义一个函数，它可以生成一个列表，其中的值是1到20之间的数的平方(包括这两个数)。然后函数需要打印列表中的最后5个元素。
# 提示：使用**运算符得到一个数字的幂。对循环使用range()。使用list.append()向列表中添加值。使用[n1:n2]对列表进行切片。
#
def funa():
    li = []
    for i in range(1,21):
        li.append(i ** 2)
    print(li[-5:])
funa()
# ### 第36题
# 问题：定义一个函数，它可以生成一个列表，其中的值是1到20之间的数的平方(包括这两个数)。然后，该函数需要打印列表中除前5个元素外的所有值。
# 提示：使用**运算符得到一个数字的幂。对循环使用range()。使用list.append()向列表中添加值。使用[n1:n2]对列表进行切片；
#
def funa():
    li = []
    for i in range(1,21):
        li.append(i ** 2)
    print(li[5:])
funa()
# ### 第37题
# 问题：定义一个函数，它可以生成并打印一个元组，其中的值是1到20之间的数的平方(包括这两个数)。
# 提示：使用**运算符得到一个数字的幂。对循环使用range()。使用list.append()向列表中添加值。使用tuple()从列表中获取一个元组。
#
def funa():
    li = []
    for i in range(1,21):
        li.append(i ** 2)
    print(tuple(li))
funa()
# ### 第38题
# 问题：对于给定的元组(1,2,3,4,5,6,7,8,9,10)，编写一个程序，在一行中输出前半部分值，在一行中输出后半部分值。
# 提示：使用[n1:n2]表示法从元组中获取切片。
#
tu = (1,2,3,4,5,6,7,8,9,10)
print(tu[:5])
print(tu[5:])
# ### 第39题
# 问题：编写程序生成并输出另一个元组，其值是给定元组(1,2,3,4,5,6,7,8,9,10)中的偶数。
# 提示：使用“for”来迭代元组，使用tuple()从列表中生成一个tuple。
#
tu = (1,2,3,4,5,6,7,8,9,10)
li = []
for i in tu:
    if i % 2 == 0:
        li.append(i)
print(tuple(li))
# ### 第40题
# 问题：写一个程序，接受一个字符串作为输入，如果字符串是“yes”或“YES”或“Yes”，否则打印“No”。
# 提示：使用if语句判断条件。
#
# s = input('请输入字符串：')
# if s == 'yes' or s == 'YES':
#     print('Yes')
# else:
#     print('No')

# ### 第41题
# 问题：编写一个程序，可以使用过滤函数过滤列表中的偶数。列表是:[1,2,3,4,5,6,7,8,9,10]。
# 提示：使用filter()过滤列表中的一些元素。使用lambda定义匿名函数。
#
li = [1,2,3,4,5,6,7,8,9,10]
task = filter(lambda x: x % 2 == 0, li)
print(list(task))
# ### 第42题
# 问题：编写一个程序，可以使用map()构造一个列表，其中的元素是[1,2,3,4,5,6,7,8,9,10]中元素的平方。
# 提示：使用map()生成列表。使用lambda定义匿名函数
#
li = [1,2,3,4,5,6,7,8,9,10]
task = map(lambda x: x ** 2 , li)
print(list(task))
# ### 第43题
# 问题：编写一个程序，它可以map()和filter()生成一个列表，其中的元素是[1,2,3,4,5,6,7,8,9,10]中的偶数的平方。
# 提示：使用map()生成列表。使用filter()来过滤列表中的元素。使用lambda定义匿名函数。
#
li = [1,2,3,4,5,6,7,8,9,10]
task = map(lambda x: x ** 2,filter(lambda x: x % 2 == 0, li))
print(list(task))
# ### 第44题
# 问题：编写一个程序，它可以使用map()生成一个列表，其中的元素是1到20之间的数的平方(包括两个数)。
# 提示：使用map()生成列表。使用lambda定义匿名函数。
task = map(lambda x: x ** 2 , range(1,21))
print(list(task))
